; domain
(define (domain p2)
(:requirements :strips :typing :action-costs)
(:types 
    location 
    crate 
    content
    person
    drone
    carrier
    num
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (carrier-at ?carrier - carrier ?location - location)
    (next-num ?numA - num ?numB - num) 
    (in-carrier ?crate - crate ?carrier - carrier)
    (crates-in-carrier ?carrier - carrier ?n - num)
    (carrier-capacity ?carrier - carrier ?n - num)
)

(:functions
    (total-cost)
    (fly-cost ?location_from - location ?location_to - location)    
)

(:action put-crate-in-carrier
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?n_current - num
        ?n_next - num
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)
        (carrier-at ?carrier ?location) 
        (crates-in-carrier ?carrier ?n_current)
        (next-num ?n_current ?n_next)
    )
    :effect (and
        (not (crates-in-carrier ?carrier ?n_current))
        (crates-in-carrier ?carrier ?n_next)
        (in-carrier ?crate ?carrier)        
        (not (crate-at ?crate ?location))  
        (increase (total-cost) 1)  
    )
)

(:action move-carrier
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
        ?carrier - carrier
    )
    :precondition (and 
        (drone-at ?drone ?location_from)
        (carrier-at ?carrier ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from))
        (drone-at ?drone ?location_to)
        (not (carrier-at ?carrier ?location_from))
        (carrier-at ?carrier ?location_to)     
        (increase (total-cost) (fly-cost ?location_from ?location_to))  
    )
)

(:action pick-and-drop
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?carrier - carrier
        ?person - person
        ?content - content 
        ?n_current - num
        ?n_prev - num
    )
    :precondition (and                 
        (drone-at ?drone ?location)       
        (carrier-at ?carrier ?location)
        (in-carrier ?crate ?carrier)
        (person-at ?person ?location)           
        (content-crate ?content ?crate) 
        (crates-in-carrier ?carrier ?n_current)
        (next-num ?n_prev ?n_current)
    )
    :effect (and
        (not (crates-in-carrier ?carrier ?n_current))
        (crates-in-carrier ?carrier ?n_prev)
        (not (in-carrier ?crate ?carrier))        
        (has-content-person ?person ?content)   
        (increase (total-cost) 1)  
    )
)
)

; problem
(define (problem drone_problem_d1_r1_l8_p8_c8_g8_ct2)
(:domain p2)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	carrier1 - carrier
	N0 - num
	N1 - num
	N2 - num
	N3 - num
	N4 - num
)
(:init
	(= (total-cost) 0)
	(= (fly-cost depot depot) 1)
	(= (fly-cost depot loc1) 219)
	(= (fly-cost depot loc2) 109)
	(= (fly-cost depot loc3) 148)
	(= (fly-cost depot loc4) 163)
	(= (fly-cost depot loc5) 146)
	(= (fly-cost depot loc6) 176)
	(= (fly-cost depot loc7) 142)
	(= (fly-cost depot loc8) 82)
	(= (fly-cost loc1 depot) 219)
	(= (fly-cost loc1 loc1) 1)
	(= (fly-cost loc1 loc2) 185)
	(= (fly-cost loc1 loc3) 72)
	(= (fly-cost loc1 loc4) 95)
	(= (fly-cost loc1 loc5) 76)
	(= (fly-cost loc1 loc6) 46)
	(= (fly-cost loc1 loc7) 78)
	(= (fly-cost loc1 loc8) 138)
	(= (fly-cost loc2 depot) 109)
	(= (fly-cost loc2 loc1) 185)
	(= (fly-cost loc2 loc2) 1)
	(= (fly-cost loc2 loc3) 127)
	(= (fly-cost loc2 loc4) 95)
	(= (fly-cost loc2 loc5) 116)
	(= (fly-cost loc2 loc6) 140)
	(= (fly-cost loc2 loc7) 130)
	(= (fly-cost loc2 loc8) 96)
	(= (fly-cost loc3 depot) 148)
	(= (fly-cost loc3 loc1) 72)
	(= (fly-cost loc3 loc2) 127)
	(= (fly-cost loc3 loc3) 1)
	(= (fly-cost loc3 loc4) 64)
	(= (fly-cost loc3 loc5) 14)
	(= (fly-cost loc3 loc6) 32)
	(= (fly-cost loc3 loc7) 12)
	(= (fly-cost loc3 loc8) 66)
	(= (fly-cost loc4 depot) 163)
	(= (fly-cost loc4 loc1) 95)
	(= (fly-cost loc4 loc2) 95)
	(= (fly-cost loc4 loc3) 64)
	(= (fly-cost loc4 loc4) 1)
	(= (fly-cost loc4 loc5) 51)
	(= (fly-cost loc4 loc6) 57)
	(= (fly-cost loc4 loc7) 74)
	(= (fly-cost loc4 loc8) 95)
	(= (fly-cost loc5 depot) 146)
	(= (fly-cost loc5 loc1) 76)
	(= (fly-cost loc5 loc2) 116)
	(= (fly-cost loc5 loc3) 14)
	(= (fly-cost loc5 loc4) 51)
	(= (fly-cost loc5 loc5) 1)
	(= (fly-cost loc5 loc6) 31)
	(= (fly-cost loc5 loc7) 24)
	(= (fly-cost loc5 loc8) 66)
	(= (fly-cost loc6 depot) 176)
	(= (fly-cost loc6 loc1) 46)
	(= (fly-cost loc6 loc2) 140)
	(= (fly-cost loc6 loc3) 32)
	(= (fly-cost loc6 loc4) 57)
	(= (fly-cost loc6 loc5) 31)
	(= (fly-cost loc6 loc6) 1)
	(= (fly-cost loc6 loc7) 42)
	(= (fly-cost loc6 loc8) 96)
	(= (fly-cost loc7 depot) 142)
	(= (fly-cost loc7 loc1) 78)
	(= (fly-cost loc7 loc2) 130)
	(= (fly-cost loc7 loc3) 12)
	(= (fly-cost loc7 loc4) 74)
	(= (fly-cost loc7 loc5) 24)
	(= (fly-cost loc7 loc6) 42)
	(= (fly-cost loc7 loc7) 1)
	(= (fly-cost loc7 loc8) 61)
	(= (fly-cost loc8 depot) 82)
	(= (fly-cost loc8 loc1) 138)
	(= (fly-cost loc8 loc2) 96)
	(= (fly-cost loc8 loc3) 66)
	(= (fly-cost loc8 loc4) 95)
	(= (fly-cost loc8 loc5) 66)
	(= (fly-cost loc8 loc6) 96)
	(= (fly-cost loc8 loc7) 61)
	(= (fly-cost loc8 loc8) 1)
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(carrier-at carrier1 depot)
	(crates-in-carrier carrier1 N0)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate food crate3)
	(content-crate food crate4)
	(content-crate food crate5)
	(content-crate food crate6)
	(content-crate food crate7)
	(content-crate medicine crate8)
	(person-at person1 loc4)
	(person-at person2 loc4)
	(person-at person3 loc3)
	(person-at person4 loc8)
	(person-at person5 loc2)
	(person-at person6 loc2)
	(person-at person7 loc6)
	(person-at person8 loc8)
	(next-num N0 N1)
	(next-num N1 N2)
	(next-num N2 N3)
	(next-num N3 N4)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 food)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person3 food)
	(has-content-person person5 food)
	(has-content-person person6 food)
	(has-content-person person7 food)
	(has-content-person person8 food)
))
(:metric minimize (total-cost))
)

; plan
1. (put-crate-in-carrier crate8 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate8 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate8 carrier1)
   goals met: 1 of 9
2. (put-crate-in-carrier crate7 depot drone1 carrier1 n1 n2)
   deleted: (crates-in-carrier carrier1 n1) (crate-at crate7 depot)
   added: (crates-in-carrier carrier1 n2) (in-carrier crate7 carrier1)
   goals met: 1 of 9
3. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 0 of 9
4. (pick-and-drop crate8 loc4 drone1 carrier1 person2 medicine n2 n1)
   deleted: (crates-in-carrier carrier1 n2) (in-carrier crate8 carrier1)
   added: (crates-in-carrier carrier1 n1) (has-content-person person2 medicine)
   goals met: 1 of 9
5. (pick-and-drop crate7 loc4 drone1 carrier1 person1 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate7 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person1 food)
   goals met: 2 of 9
6. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 3 of 9
7. (put-crate-in-carrier crate6 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate6 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate6 carrier1)
   goals met: 3 of 9
8. (move-carrier depot loc4 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   goals met: 2 of 9
9. (pick-and-drop crate6 loc4 drone1 carrier1 person2 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate6 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person2 food)
   goals met: 3 of 9
10. (move-carrier loc4 depot drone1 carrier1)
   deleted: (drone-at drone1 loc4) (carrier-at carrier1 loc4)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 4 of 9
11. (put-crate-in-carrier crate5 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate5 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate5 carrier1)
   goals met: 4 of 9
12. (move-carrier depot loc3 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   goals met: 3 of 9
13. (pick-and-drop crate5 loc3 drone1 carrier1 person3 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate5 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person3 food)
   goals met: 4 of 9
14. (move-carrier loc3 depot drone1 carrier1)
   deleted: (drone-at drone1 loc3) (carrier-at carrier1 loc3)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 5 of 9
15. (put-crate-in-carrier crate4 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate4 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate4 carrier1)
   goals met: 5 of 9
16. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 4 of 9
17. (pick-and-drop crate4 loc2 drone1 carrier1 person5 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate4 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person5 food)
   goals met: 5 of 9
18. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 6 of 9
19. (put-crate-in-carrier crate3 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate3 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate3 carrier1)
   goals met: 6 of 9
20. (move-carrier depot loc2 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   goals met: 5 of 9
21. (pick-and-drop crate3 loc2 drone1 carrier1 person6 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate3 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person6 food)
   goals met: 6 of 9
22. (move-carrier loc2 depot drone1 carrier1)
   deleted: (drone-at drone1 loc2) (carrier-at carrier1 loc2)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 7 of 9
23. (put-crate-in-carrier crate2 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate2 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate2 carrier1)
   goals met: 7 of 9
24. (move-carrier depot loc6 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   goals met: 6 of 9
25. (pick-and-drop crate2 loc6 drone1 carrier1 person7 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate2 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person7 food)
   goals met: 7 of 9
26. (move-carrier loc6 depot drone1 carrier1)
   deleted: (drone-at drone1 loc6) (carrier-at carrier1 loc6)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 8 of 9
27. (put-crate-in-carrier crate1 depot drone1 carrier1 n0 n1)
   deleted: (crates-in-carrier carrier1 n0) (crate-at crate1 depot)
   added: (crates-in-carrier carrier1 n1) (in-carrier crate1 carrier1)
   goals met: 8 of 9
28. (move-carrier depot loc8 drone1 carrier1)
   deleted: (drone-at drone1 depot) (carrier-at carrier1 depot)
   added: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   goals met: 7 of 9
29. (pick-and-drop crate1 loc8 drone1 carrier1 person8 food n1 n0)
   deleted: (crates-in-carrier carrier1 n1) (in-carrier crate1 carrier1)
   added: (crates-in-carrier carrier1 n0) (has-content-person person8 food)
   goals met: 8 of 9
30. (move-carrier loc8 depot drone1 carrier1)
   deleted: (drone-at drone1 loc8) (carrier-at carrier1 loc8)
   added: (drone-at drone1 depot) (carrier-at carrier1 depot)
   goals met: 9 of 9
